let knowledge =
    [
        ["автором работы", "является", "Курильчик Иван Олегович"],
        ["кассетный магнитофон", "это", "устройство для воспроизведения и записи звука на магнитной ленте в компакт-кассетах."],
        ["магнитная лента", "это", "основной носитель информации в кассетных магнитофонах, представляющий собой тонкую пластиковую ленту с нанесённым на неё слоем магнитного материала."],
        ["компакт-кассета", "это", "пластиковый корпус, содержащий две катушки с магнитной лентой, используемый в кассетных магнитофонах."],
        ["головка записи", "это", "элемент кассетного магнитофона, который намагничивает магнитную ленту, создавая записи звука."],
        ["головка воспроизведения", "это", "элемент кассетного магнитофона, считывающий информацию с магнитной ленты и преобразующий её в звуковой сигнал."],
        ["перемоткой", "называется", "процесс, при котором кассетный магнитофон перемещать магнитную ленту с одного ролика на другой."],
        ["производителями магнитофонов", "являются", "компании, такие как Sony, Philips, Panasonic, Aiwa и другие, игравшие ключевую роль в развитии кассетных технологий."],
        ["долговечность кассет", "обеспечивается", "способностью кассет сохранять качество записи на протяжении длительного времени при правильном хранении."],
        ["аудиокассета", "это", "стандартная кассета с магнитной лентой, предназначенная для записи и воспроизведения звука в кассетных магнитофонах."],
        ["стерео", "это", "способ записи и воспроизведения звука, при котором используются два независимых звуковых канала для создания объемного звучания."],
        ["плейбек", "это", "процесс воспроизведения ранее записанного звука с кассеты."],
        ["магнитным полем", "называется", "физическое поле, создаваемое электрическими токами и намагниченными телами, воздействующее на магнитную ленту при записи и воспроизведении."],
        ["двигатель перемотки", "это", "механизм кассетного магнитофона, обеспечивающий движение магнитной ленты при перемотке вперёд или назад."],
        ["ленто-протяжный механизм", "это", "система, обеспечивающая равномерное движение магнитной ленты мимо головок записи и воспроизведения."],
        ["пресс-ролик", "это", "компонент кассетного магнитофона, прижимающий магнитную ленту к ведущему валику для обеспечения стабильного движения ленты."],
        ["формат аудиокассеты", "обозначает", "стандартный размер и конфигурацию кассеты, разработанные Philips, ставшие общемировым стандартом."],
        ["переходом к цифровым носителям", "называется", "процесс замена аналоговых кассет цифровыми носителями, такими как компакт-диски и MP3, начиная с 1990-х годов."]
        ["ведущий валик", "это", "деталь кассетного магнитофона, которая обеспечивает постоянную скорость движения магнитной ленты при воспроизведении и записи."],
        ["скоростью ленты", "называется", "показатель, определяющий скорость перемещения магнитной ленты в кассетном магнитофоне."],
        ["аналоговые технологии", "представляют", "технологии записи и воспроизведения звука, использующие непрерывные сигналы, как в кассетных магнитофонах."],
        ["культура микстейпов", "это", "популярная в 1980-е и 1990-е годы практика создания сборников любимых песен на кассетах."],
        ["кассетный отсек", "это", "часть кассетного магнитофона, куда вставляется компакт-кассета для воспроизведения или записи звука."],
        ["аудиокабелем", "называется", "провод, используемый для передачи аудиосигнала между кассетным магнитофоном и другими устройствами, такими как усилители и колонки."],
        ["динамический диапазон", "это", "разница между самым тихим и самым громким звуками, которые может воспроизводить или записывать кассетный магнитофон."],
        ["внешним источником питания", "является", "устройство, обеспечивающее электропитание кассетного магнитофона от сети или батарей."],
        ["регулятор громкости", "это", "элемент управления кассетного магнитофона, позволяющий настраивать уровень звука при воспроизведении."],
        ["баланс каналов", "это", "функция кассетного магнитофона, позволяющая регулировать громкость между левым и правым аудиоканалами для создания оптимального стереозвучания."],
        ["пауза", "это", "функция кассетного магнитофона, позволяющая временно останавливать воспроизведение или запись без полной остановки магнитной ленты."],
        ["автоматическая остановка", "это", "функция кассетного магнитофона, автоматически останавливающая движение ленты при достижении конца кассеты."],
        ["цифровой дисплей", "это", "экран на кассетном магнитофоне, отображающий информацию о текущем состоянии устройства, времени воспроизведения и других параметрах."],
        ["синхронизация", "это", "процесс согласования работы кассетного магнитофона с другими аудиоустройствами для обеспечения одновременного воспроизведения или записи звука."],
        ["эквалайзер", "используется", "в кассетном магнитофоне, позволяет регулировать уровень различных частот звукового сигнала для улучшения качества звучания."],
        ["фильтр низких частот", "используется", "в кассетном магнитофоне для уменьшения уровня низкочастотных шумов."],
        ["память станций", "это", "функция кассетного магнитофона, позволяющая сохранять настройки радиостанций для быстрого доступа."],
        ["аналоговый сигнал", "это", "непрерывный сигнал, представляющий звуковую информацию, который используется в кассетных магнитофонах для записи и воспроизведения звука."],
        ["перезапись", "это", "процесс записи нового аудиосигнала поверх уже существующего на магнитной ленте кассеты."],
        ["внешним микрофоном", "называется", "устройство, подключаемое к кассетному магнитофону для записи звука с более высоким качеством по сравнению с встроенным микрофоном."],
        ["панелью управления", "является", "интерфейс кассетного магнитофона, содержащий кнопки и регуляторы для управления его функциями."],
        ["индикатор уровня", "это", "устройство на кассетном магнитофоне, показывающее текущий уровень аудиосигнала при записи или воспроизведении."],
        ["кушетка", "это", "часть кассетного магнитофона, обеспечивающая стабильное натяжение магнитной ленты."],
        ["плавающая головка", "это", "специальный тип головки воспроизведения в кассетных магнитофонах, который автоматически регулирует своё положение для обеспечения оптимального контакта с магнитной лентой."],
        ["звук", "это", "механические колебания, распространяющиеся в упругой среде и воспринимаемые органами слуха."],
        ["аудио", "это", "всё, что связано с записью, передачей и воспроизведением звуков."],
        ["динамик", "это", "устройство для преобразования электрических сигналов в звуковые колебания."],
        ["усилитель", "это", "устройство для увеличения мощности аудиосигнала."],
        ["аналоговая запись", "это", "метод записи звуковой информации с использованием непрерывного сигнала, как на магнитной ленте."],
        ["цифровая запись", "это", "метод записи звуковой информации с использованием цифровых сигналов, представленных в виде двоичных кодов."],
        ["монофонический звук", "это", "звук, воспроизводимый через один канал."],
        ["магнитный порошок", "используется", "для записи и хранения звуковых сигналов."],
        ["головка стирания", "используется", "для удаления ранее записанной информации с кассетной ленты"],
        ["плейлисты", "это", "списки звуковых треков, организованных для последовательного воспроизведения."],
        ["пластиковый корпус", "это", "оболочка, в которую заключены внутренние механизмы и компоненты кассеты или кассетного магнитофона."],
        ["электрический сигнал", "это", "передача данных через изменение электрического тока или напряжения."],
        ["частота", "это", "количество колебаний звуковой волны в единицу времени, измеряемое в герцах."],
        ["герц", "это", "единица измерения частоты колебательных процессов, равная одному колебанию в секунду."],
        ["радио", "это", "средство беспроводной передачи звуковых сигналов посредством радиоволн."],
        ["стереоэффектом", "называется", "эффект объёмного звука, создаваемый при воспроизведении звука через два или более источника."],
        ["акустика", "это", "наука о звуке, его производстве, передаче и восприятии."],
        ["диктофон", "это", "устройство для записи речи и звуков, часто используемое для записи интервью или заметок."],
        ["треки", "это", "индивидуальные звуковые записи, хранящиеся на кассете или в цифровом формате."],
        ["воспроизведением", "называется", "процесс восстановления записанного звука из аудионосителя."],
        ["эквализация", "это", "процесс регулирования баланса различных частотных компонентов аудиосигнала."],
        ["децибел", "это", "единица измерения уровня звукового давления или громкости."],
        ["аудиотехникой", "называется", "оборудование, используемое для записи, передачи и воспроизведения звука."],
        ["пластинки", "являются", "диском из винила, на который нанесены звуковые дорожки для воспроизведения с помощью проигрывателя."],
        ["проигрыватель", "это", "устройство для воспроизведения звука с виниловых пластинок."],
        ["радиоприёмник", "это", "устройство для приёма радиосигналов и преобразования их в звук."],
        ["антенной", "называется", "устройство для приёма или передачи радиоволн."],
        ["резонанс", "это", "усиление звуковых колебаний, происходящее при совпадении частот внешнего воздействия и собственных частот системы."],
        ["плавкость", "это", "свойство материала переходить из твёрдого состояния в жидкое при нагревании, используемое при производстве компонентов кассетных магнитофонов."],
        ["история магнитофона", "это", "развитие и совершенствование технологии записи и воспроизведения звука на магнитной ленте."],
        ["кассета", "это", "компактный пластиковый корпус с магнитной лентой, изобретённый компанией Philips в 1963 году."],
        ["Фриц Пфлеймер", "это", "немецкий инженер, изобретатель магнитной ленты, использовавшейся для записи звука."],
        ["компания Philips", "это", "голландская компания, которая в 1963 году представила первую компакт-кассету."],
        ["первый кассетный магнитофон", "это", "устройство, выпущенное компанией Philips в 1965 году."],
        ["кассетный бум", "это", "период массового распространения кассетных магнитофонов и кассет в 1970-1980-е годы."],
        ["портативный кассетный плеер", "это", "устройство для воспроизведения кассет, популярное в 1980-е годы, впервые выпущенное компанией Sony под названием Walkman."],
        ["история магнитной ленты", "это", "развитие технологии записи информации на тонкий слой магнитного материала, начиная с изобретения в 1928 году."],
        ["гибридные кассеты", "это", "кассеты, сочетающие в себе возможности аналоговой и цифровой записи, появившиеся в конце 1990-х годов."],
        ["революция звукозаписи", "это", "изменения в индустрии звукозаписи и распространении музыки, вызванные появлением магнитофонов и кассет."],
        ["популяризация музыки", "это", "широкое распространение музыкальных записей благодаря доступности кассетных магнитофонов."]
    ];

let endings =
    [
        ["ет", "(ет|ут|ют)"],
        ["ут", "(ет|ут|ют)"],
        ["ют", "(ет|ут|ют)"],		     //1 спряжение

        ["ит", "(ит|ат|ят)"],
        ["ат", "(ит|ат|ят)"],
        ["ят", "(ит|ат|ят)"],		     //2 спряжение

        ["ется", "(ет|ут|ют)ся"],
        ["утся", "(ет|ут|ют|ующие)ся"],
        ["ются", "(ет|ут|ют)ся"], //1 спряжение, возвратные

        ["ится", "(ит|ат|ят)ся"],
        ["атся", "(ит|ат|ят)ся"],
        ["ятся", "(ит|ат|ят)ся"],     //2 спряжение, возвратные

        ["ящие", "ящие"],
        ["ee", "ee"],
        ["ен", "ен"],
        ["ую", "ая"],
        ["му", "ма"],
        ["ена", "ена"],
        ["ено", "ено"],
        ["ены", "ены"],		    //краткие прилагательные

        ["ан", "ан"],
        ["ая", "ую"],
        ["ана", "ана"],
        ["ано", "ано"],
        ["аны", "аны"],		    //краткие прилагательные

        ["но", "но"],
        ["на", "на"],

        ["жен", "жен"],
        ["жна", "жна"],
        ["жно", "жно"],
        ["жны", "жны"],

        ["такое", "это"],
    ]

let blacklist = ["замена", "замены", "атрибут", "маршрут", "нет"]

function getEndingIndex(word) {
    //проверка слова на совпадение по черному списку в массиве blacklist
    if (blacklist.indexOf(word) !== -1)
        return -1;

    for (let i = 0; i < endings.length; i++)
        if (word.substring(word.length - endings[i][0].length) == endings[i][0])
            return i;

    return -1;
}

function firstSymbolToLowerCase(str) {
    return str.substring(0, 1).toLowerCase() + str.substring(1);
}

function firstSymbolToUpperCase(str) {
    return str.substring(0, 1).toUpperCase() + str.substring(1);
}
function getAnswer(question) {
    // Преобразование текста из параметра функции question, чтобы сделать первую букву в тексте вопроса прописной
    let text = firstSymbolToLowerCase(question);
    // Знаки препинания
    let separators = "'\",.!?()[]\\/";
    // Добавление пробелов перед знаками препинания
    for (let i = 0; i < separators.length; i++) {
        text = text.replace(separators[i], " " + separators[i]);
    }

    // Массив слов и знаков препинания, отделенных пробелами
    let words = text.split(' ');

    // Перебор слов в массиве слов из вопроса
    for (let i = 0; i < words.length; i++) {
        words[i] = firstSymbolToLowerCase(words[i]);
    }

    let result = false;
    let answer = "";

    for (let i = 0; i < words.length; i++) {
        let ending = getEndingIndex(words[i]);

        if (ending >= 0) {
            words[i] = words[i].substring(0, words[i].length - endings[ending][0].length) + endings[ending][1];

            console.log(words);

            // Создание регулярного выражения для поиска по сказуемому из вопроса
            let predicate = new RegExp(".*" + words[i] + ".*");

            // Для кратких прилагательных нужно захватить следующее за найденным слово
            if (endings[ending][0] == endings[ending][1]) {
                if (words[i] != "нужен") {
                    predicate = new RegExp(".*" + words[i] + " " + words[i + 1] + ".*");
                    i++;
                }
            }
            console.log(predicate);

            // Создание регулярного выражения для поиска по подлежащему из вопроса
            let subjectReg = words.slice(i + 1).join(".*");
            console.log(subjectReg);

            // Только если в подлежащем больше трех символов
            if (subjectReg.length > 3) {
                let subject = new RegExp(".*" + subjectReg + ".*");
                console.log(subject);

                // Функция для поиска совпадений в заданном слоте (0 или 2)
                function searchInSlot(slot) {
                    for (let j = 0; j < knowledge.length; j++) {
                        if (knowledge[j] && knowledge[j][slot] && knowledge[j][1]) { // Добавлена проверка на наличие элементов
                            console.log(knowledge[j]);
                            if (predicate.test(knowledge[j][1].toLowerCase()) && subject.test(knowledge[j][slot].toLowerCase())) {
                                // Создание простого предложения из семантической связи
                                answer = firstSymbolToUpperCase(knowledge[j][0] + " " + knowledge[j][1] + " " + knowledge[j][2] + `<br><img id="bzImage" src="./image/result/${knowledge[j][0]}.png"/>`);
                                result = true;
                                return true; // Возврат из функции, чтобы прекратить поиск
                            }
                        }
                    }
                    return false; // Если ничего не найдено
                }

                // Поиск в первом слоте
                if (searchInSlot(0)) break;

                // Если совпадений с первым слотом нет, поиск в третьем слоте
                if (!result && searchInSlot(2)) break;

                // Если совпадений с двумя слотами нет
                if (!result) {
                    for (let j = 0; j < knowledge.length; j++) {
                        if (knowledge[j] && knowledge[j][0] && knowledge[j][2]) { // Добавлена проверка на наличие элементов
                            if (subject.test(knowledge[j][0].toLowerCase()) || subject.test(knowledge[j][2].toLowerCase())) {
                                // Создание простого предложения из семантической связи

                                answer = firstSymbolToUpperCase(knowledge[j][0] + " " + knowledge[j][1] + " " + knowledge[j][2]);
                                result = true;
                                break;
                            }
                        }
                    }
                }
                if (result) break; // Выход из основного цикла, если найден результат
            }
        }
    }

    // Если ответа нет
    if (!result) {
        answer = "Ответ не найден.";
    }
    return answer;
}



// console.log(getAnswer("для чего используются мягкие ферромагнетики"));